Repository: roman-gorbachev/OurMemory-ios
Catalog: OurMemory/Resources/Localizable.xcstrings
Source language: ru
Languages: be, en, zh_hans

# about_cemetery
source: О кладбище
be: Пра могілкі
en: About
zh_hans: 关于公墓

# account_not_found_msg
source: Аккаунт с таким e-mail не найден. Попросите человека сначала войти в приложение
be: Акаўнт з такім e-mail не знойдзены. Папрасіце чалавека спачатку ўвайсці ў праграму
en: No account with this e-mail was found. Ask the person to sign in to the app first
zh_hans: 未找到使用此电子邮件的账户。请让对方先登录应用

# add_administrator
source: Добавить администратора
be: Дадаць адміністратара
en: Add administrator
zh_hans: 添加管理员

# add_administrator_steps
source: Новый администратор один раз входит в приложение: через Google в «Ещё» или через «Вход для администратора» со своим e-mail. Супер-администратор открывает Админ → «Администраторы» и добавляет его по e-mail. Storage → Rules: допишите UID нового администратора (его можно скопировать на экране «Администраторы») в список функции isAdmin() и нажмите «Publish». Без этого он не сможет загружать фото и аудио. После перезапуска приложения у нового администратора появляется вкладка «Админ». Чтобы снять права, удалите администратора на экране «Администраторы» и уберите его UID из правил Storage. Супер-администраторы назначаются только в Firebase Console: узел OurMemory/SuperAdmins, ключ UID со значением true (и тот же UID в OurMemory/Admins).
be: Новы адміністратар адзін раз уваходзіць у праграму: праз Google у «Яшчэ» або праз «Уваход для адміністратара» са сваім e-mail. Супер-адміністратар адкрывае Адмін → «Адміністратары» і дадае яго па e-mail. Storage → Rules: дапішыце UID новага адміністратара (яго можна скапіраваць на экране «Адміністратары») у спіс функцыі isAdmin() і націсніце «Publish». Без гэтага ён не зможа загружаць фота і аўдыя. Пасля перазапуску праграмы ў новага адміністратара з’яўляецца ўкладка «Адмін». Каб зняць правы, выдаліце адміністратара на экране «Адміністратары» і прыбярыце яго UID з правілаў Storage. Супер-адміністратары прызначаюцца толькі ў Firebase Console: вузел OurMemory/SuperAdmins, ключ UID са значэннем true (і той жа UID у OurMemory/Admins).
en: The new administrator signs in to the app once: with Google in More or via “Administrator sign-in” with their e-mail. A super administrator opens Admin → “Administrators” and adds them by e-mail. Storage → Rules: add the new administrator's UID (it can be copied on the Administrators screen) to the isAdmin() function list and tap “Publish”. Without this they cannot upload photos and audio. After restarting the app, the new administrator gets the Admin tab. To revoke rights, remove the administrator on the Administrators screen and delete their UID from the Storage rules. Super administrators are assigned only in the Firebase Console: the OurMemory/SuperAdmins node, the UID key with the value true (and the same UID in OurMemory/Admins).
zh_hans: 新管理员先登录一次应用：在“更多”中使用 Google，或通过“管理员登录”使用自己的电子邮件。 超级管理员打开 管理 → “管理员”，按电子邮件添加。 Storage → Rules：将新管理员的 UID（可在“管理员”页面复制）添加到 isAdmin() 函数列表中，然后点击“Publish”。否则对方无法上传照片和音频。 重启应用后，新管理员会看到“管理”标签页。 要撤销权限，请在“管理员”页面移除该管理员，并从 Storage 规则中删除其 UID。 超级管理员只能在 Firebase Console 中指定：在 OurMemory/SuperAdmins 节点下添加 UID 键，值为 true（并在 OurMemory/Admins 中添加同一 UID）。

# add_and_remove_administrators_msg
source: Добавление и удаление администраторов
be: Даданне і выдаленне адміністратараў
en: Add and remove administrators
zh_hans: 添加和移除管理员

# add_audio
source: Добавить аудио
be: Дадаць аўдыя
en: Add audio
zh_hans: 添加音频

# add_burial_place
source: Добавить место
be: Дадаць месца
en: Add place
zh_hans: 添加地点

# add_burials_first_msg
source: Начните с мест захоронения: ветераны и экскурсии ссылаются на них
be: Пачніце з месцаў пахавання: ветэраны і экскурсіі спасылаюцца на іх
en: Start with burial places: veterans and tours refer to them
zh_hans: 请先添加安葬地点：老兵和导览都会引用它们

# add_paragraph
source: Добавить абзац
be: Дадаць абзац
en: Add paragraph
zh_hans: 添加段落

# add_photo
source: Добавить фото
be: Дадаць фота
en: Add photo
zh_hans: 添加照片

# add_photos
source: Добавить фото
be: Дадаць фота
en: Add photos
zh_hans: 添加照片

# add_stop
source: Добавить остановку
be: Дадаць прыпынак
en: Add stop
zh_hans: 添加站点

# add_to_card
source: Добавить в карточку
be: Дадаць у картку
en: Add to card
zh_hans: 添加到卡片

# add_to_favorites
source: Добавить в избранное
be: Дадаць у абранае
en: Add to favorites
zh_hans: 添加到收藏

# add_to_history
source: Дополнить историю
be: Дапоўніць гісторыю
en: Add to the story
zh_hans: 补充故事

# add_tour
source: Добавить экскурсию
be: Дадаць экскурсію
en: Add tour
zh_hans: 添加导览

# add_uid_to_storage_rules_msg
source: Чтобы администратор мог загружать фото и аудио, добавьте его UID в функцию isAdmin() правил Storage
be: Каб адміністратар мог загружаць фота і аўдыя, дадайце яго UID у функцыю isAdmin() правілаў Storage
en: To let the administrator upload photos and audio, add their UID to the isAdmin() function of the Storage rules
zh_hans: 要让管理员能上传照片和音频，请将其 UID 添加到 Storage 规则的 isAdmin() 函数中

# add_veteran
source: Добавить ветерана
be: Дадаць ветэрана
en: Add veteran
zh_hans: 添加老兵

# added_to_card
source: Добавлено в карточку
be: Дададзена ў картку
en: Added to card
zh_hans: 已添加到卡片

# address
source: ул. Козлова, 11, Минск
be: вул. Казлова, 11, Мiнск
en: 11 Kozlova St, Minsk
zh_hans: 明斯克，科兹洛夫街11号

# admin
source: Админ
be: Адмін
en: Admin
zh_hans: 管理

# administration
source: Администрирование
be: Адміністраванне
en: Administration
zh_hans: 管理

# administrator_added_msg
source: Администратор добавлен. Вкладка «Админ» появится у него после перезапуска приложения
be: Адміністратар дададзены. Укладка «Адмін» з’явіцца ў яго пасля перазапуску праграмы
en: Administrator added. The Admin tab will appear for them after restarting the app
zh_hans: 已添加管理员。重启应用后，对方将看到“管理”标签页

# administrators
source: Администраторы
be: Адміністратары
en: Administrators
zh_hans: 管理员

# allow_location_access_msg
source: Разрешите доступ к геолокации, чтобы увидеть себя на карте
be: Дазвольце доступ да геалакацыі, каб убачыць сябе на карце
en: Allow location access to see yourself on the map
zh_hans: 允许访问位置，即可在地图上看到自己

# already_administrator_msg
source: Этот аккаунт уже администратор
be: Гэты акаўнт ужо адміністратар
en: This account is already an administrator
zh_hans: 此账户已是管理员

# app_name
source: Наша память
be: Наша памяць
en: Our Memory
zh_hans: 我们的记忆

# appearance
source: Оформление
be: Афармленне
en: Appearance
zh_hans: 外观

# approve
source: Одобрить
be: Ухваліць
en: Approve
zh_hans: 通过

# approved
source: Одобрено
be: Ухвалена
en: Approved
zh_hans: 已通过

# art
source: Деятели искусств
be: Творчасць
en: Artists
zh_hans: 艺术家

# as_in_system
source: Как в системе
be: Як у сістэме
en: System
zh_hans: 跟随系统

# audio_attached
source: Аудио прикреплено
be: Аўдыя прымацавана
en: Audio attached
zh_hans: 已附加音频

# audio_tours_of_cemetery
source: Аудиоэкскурсии по кладбищу
be: Аўдыяэкскурсіі па могілках
en: Audio tours of the cemetery
zh_hans: 公墓语音导览

# audio_tours_of_cemetery_msg
source: Маршруты на карте с рассказом у каждого захоронения
be: Маршруты на карце з расповедам ля кожнага пахавання
en: Routes on the map with a story at every grave
zh_hans: 地图上的路线，每处墓地都有讲解

# awaiting_review
source: На проверке
be: На праверцы
en: Awaiting review
zh_hans: 待审核

# awards
source: Награды
be: Узнагароды
en: Awards
zh_hans: 荣誉

# biography
source: Биография
be: Бiяграфiя
en: Biography
zh_hans: 生平

# biography_and_media
source: Биография и медиа
be: Біяграфія і медыя
en: Biography and media
zh_hans: 生平和媒体

# birthday_in_year
source: День рождения · %1$lld
be: Дзень нараджэння · %1$lld
en: Birthday · %1$lld
zh_hans: 生日 · %1$lld

# burial_place
source: Место захоронения
be: Месца пахавання
en: Burial place
zh_hans: 安葬地点

# burial_place_steps
source: Админ → Места захоронения → «Добавить место». Выберите тип: могила, братская могила или памятник. Впишите участок, ряд и место с таблички кладбища. Это точнее GPS, и посетители ищут именно по этим номерам. Встаньте у могилы и нажмите «Моё местоположение». Если метка легла неточно, нажмите на карту в нужной точке. Добавьте фото и короткое описание, если есть, и нажмите «Сохранить».
be: Адмін → Месцы пахавання → «Дадаць месца». Выберыце тып: магіла, брацкая магіла або помнік. Упішыце ўчастак, рад і месца з таблічкі могілак. Гэта дакладней за GPS, і наведвальнікі шукаюць менавіта па гэтых нумарах. Станьце каля магілы і націсніце «Маё месцазнаходжанне». Калі метка лягла недакладна, націсніце на карту ў патрэбнай кропцы. Дадайце фота і кароткае апісанне, калі ёсць, і націсніце «Захаваць».
en: Admin → Burial places → “Add place”. Choose the type: grave, mass grave or monument. Enter the section, row and plot from the cemetery plate. This is more accurate than GPS, and visitors search by these numbers. Stand by the grave and tap “My location”. If the marker is off, tap the map at the right point. Add a photo and a short description if you have them, and tap “Save”.
zh_hans: 管理 → 安葬地点 → “添加地点”。 选择类型：墓、合葬墓或纪念碑。 填写公墓标牌上的区、排和号。这比 GPS 更准确，访客也是按这些编号查找的。 站在墓旁点击“我的位置”。如果标记不准确，请点击地图上的正确位置。 如有照片和简短描述，请添加后点击“保存”。

# burial_places
source: Места захоронения
be: Месцы пахавання
en: Burial places
zh_hans: 安葬地点

# burial_places_count
source: %lld места
be: %lld месца
en: %lld places
zh_hans: %lld 个地点

# cancel
source: Отмена
be: Адмена
en: Cancel
zh_hans: 取消

# candle_and_favorites
source: Свеча памяти и избранное
be: Свечка памяці і абранае
en: Memorial candle and favorites
zh_hans: 纪念蜡烛和收藏

# candle_and_favorites_msg
source: Зажгите свечу, сохраните близких в избранном и получайте напоминания о памятных датах
be: Запаліце свечку, захавайце блізкіх у абраным і атрымлівайце напаміны пра памятныя даты
en: Light a candle, keep your loved ones in favorites and get reminders of memorable dates
zh_hans: 点亮蜡烛，收藏亲人，并接收纪念日提醒

# candle_is_lit
source: Свеча зажжена
be: Свечка запалена
en: Candle is lit
zh_hans: 蜡烛已点亮

# candles_count
source: Зажжено %lld свечи
be: Запалена %lld свечкі
en: %lld candles lit
zh_hans: 已点亮 %lld 支蜡烛

# caption
source: Подпись
be: Подпіс
en: Caption
zh_hans: 说明

# cemetery_map
source: Карта кладбища
be: Карта могілак
en: Cemetery map
zh_hans: 公墓地图

# check_new_marker_msg
source: Проверьте результат на вкладке «Карта»: новая метка должна стоять на своём месте.
be: Праверце вынік на ўкладцы «Карта»: новая метка павінна стаяць на сваім месцы.
en: Check the result on the Map tab: the new marker should be in its place.
zh_hans: 在“地图”标签页检查结果：新标记应位于正确的位置。

# check_stresses_before_msg
source: Перед озвучкой проверьте текст: ударения в фамилиях, годы прописью, сокращения раскрыты полностью.
be: Перад агучкай праверце тэкст: націскі ў прозвішчах, гады словамі, скарачэнні раскрыты цалкам.
en: Check the text before recording: stresses in surnames, years written out in words, abbreviations spelled out in full.
zh_hans: 录音前请检查文本：姓氏的重音、年份用文字写出、缩写完整展开。

# checking_photo
source: Проверяем фото
be: Правяраем фота
en: Checking photo
zh_hans: 正在检查照片

# chooseCategory
source: Выберите категорию
be: Выберыце катэгорыю
en: Choose a category
zh_hans: 选择类别

# choose_portrait
source: Выбрать портрет
be: Выбраць партрэт
en: Choose portrait
zh_hans: 选择肖像

# clear
source: Очистить
be: Ачысціць
en: Clear
zh_hans: 清除

# comment_for_author
source: Комментарий для автора (необязательно)
be: Каментар для аўтара (неабавязкова)
en: Comment for the author (optional)
zh_hans: 给作者的备注（可选）

# consent_to_contact_msg
source: Я согласен(на), чтобы мои контактные данные использовались только для связи по этому материалу
be: Я згодны(ная), каб мае кантактныя даныя выкарыстоўваліся толькі для сувязі па гэтым матэрыяле
en: I agree that my contact details will be used only to contact me about this material
zh_hans: 我同意我的联系方式仅用于就此材料与我联系

# contact_for_reply
source: Как с вами связаться (необязательно)
be: Як з вамі звязацца (неабавязкова)
en: How to reach you (optional)
zh_hans: 联系方式（可选）

# content
source: Контент
be: Кантэнт
en: Content
zh_hans: 内容

# content_language
source: Язык контента
be: Мова кантэнту
en: Content language
zh_hans: 内容语言

# copy_paragraphs_from_russian
source: Скопировать абзацы из русского
be: Скапіраваць абзацы з рускай
en: Copy paragraphs from Russian
zh_hans: 从俄语复制段落

# copy_uid
source: Скопировать UID
be: Скапіраваць UID
en: Copy UID
zh_hans: 复制 UID

# could_not_open_photo_msg
source: Не удалось открыть фото. Выберите другое
be: Не атрымалася адкрыць фота. Выберыце іншае
en: Couldn't open the photo. Choose another one
zh_hans: 无法打开照片。请选择其他照片

# could_not_sign_in_msg
source: Не удалось войти. Проверьте интернет и попробуйте ещё раз
be: Не атрымалася ўвайсці. Праверце інтэрнэт і паспрабуйце яшчэ раз
en: Couldn't sign in. Check your internet connection and try again
zh_hans: 登录失败。请检查网络后重试

# dark
source: Тёмная
be: Цёмная
en: Dark
zh_hans: 深色

# data_error
source: Ошибка в данных
be: Памылка ў даных
en: Data error
zh_hans: 数据错误

# date_of_birth
source: Дата рождения
be: Дата нараджэння
en: Date of birth
zh_hans: 出生日期

# date_of_death
source: Дата смерти
be: Дата смерці
en: Date of death
zh_hans: 逝世日期

# day_of_memory_in_year
source: День памяти · %1$lld
be: Дзень памяці · %1$lld
en: Day of remembrance · %1$lld
zh_hans: 纪念日 · %1$lld

# delete
source: Удалить
be: Выдаліць
en: Delete
zh_hans: 删除

# delete_tour_msg
source: Удалить экскурсию? Она исчезнет из приложения
be: Выдаліць экскурсію? Яна знікне з праграмы
en: Delete this tour? It will disappear from the app
zh_hans: 删除此导览？它将从应用中消失

# delete_veteran_msg
source: Удалить ветерана? Карточка исчезнет из приложения
be: Выдаліць ветэрана? Картка знікне з праграмы
en: Delete this veteran? The card will disappear from the app
zh_hans: 删除这位老兵？卡片将从应用中消失

# deleted_items_cannot_be_restored_msg
source: Удалённое можно вернуть только вручную, поэтому перед удалением убедитесь, что открыта нужная карточка.
be: Выдаленае можна вярнуць толькі ўручную, таму перад выдаленнем пераканайцеся, што адкрыта патрэбная картка.
en: Deleted items can only be restored by hand, so make sure the right card is open before deleting.
zh_hans: 删除的内容只能手动恢复，因此删除前请确认打开的是正确的卡片。

# description
source: Описание
be: Апісанне
en: Description
zh_hans: 描述

# do_not_publish_whole_rules_file_msg
source: Не публикуйте файлы правил из проекта целиком: база общая с другими приложениями, и их правила сотрутся. Правьте только узел OurMemory.
be: Не публікуйце файлы правілаў з праекта цалкам: база агульная з іншымі праграмамі, і іх правілы сатруцца. Змяняйце толькі вузел OurMemory.
en: Don't publish the rules files from the project as a whole: the database is shared with other apps, and their rules would be erased. Edit only the OurMemory node.
zh_hans: 不要整体发布项目中的规则文件：数据库与其他应用共用，它们的规则会被清除。只修改 OurMemory 节点。

# docs
source: Документы и фотографии
be: Дакументы i фатаздымкi
en: Documents and photos
zh_hans: 文件和照片

# done
source: Готово
be: Гатова
en: Done
zh_hans: 完成

# editor_guide
source: Памятка редактора
be: Памятка рэдактара
en: Editor's guide
zh_hans: 编辑指南

# everything_is_reviewed_msg
source: Всё просмотрено
be: Усё прагледжана
en: All reviewed
zh_hans: 已全部处理

# expand
source: Развернуть
be: Разгарнуць
en: Expand
zh_hans: 展开

# extra_large
source: Очень крупный
be: Вельмі буйны
en: Extra large
zh_hans: 特大

# failed_to_load_data_msg
source: Не удалось загрузить данные. Проверьте подключение к интернету
be: Не атрымалася загрузіць даныя. Праверце падключэнне да інтэрнэту
en: Couldn't load data. Check your internet connection
zh_hans: 无法加载数据。请检查网络连接

# failed_to_open_scanner_msg
source: Не удалось открыть сканер. Попробуйте навести обычную камеру на QR-код
be: Не ўдалося адкрыць сканер. Паспрабуйце навесці звычайную камеру на QR-код
en: Couldn't open the scanner. Try pointing the regular camera at the QR code
zh_hans: 无法打开扫描器。请尝试用相机直接对准二维码

# failed_to_save_msg
source: Не удалось сохранить. Проверьте подключение к интернету и попробуйте ещё раз
be: Не ўдалося захаваць. Праверце падключэнне да інтэрнэту і паспрабуйце яшчэ раз
en: Couldn't save. Check your internet connection and try again
zh_hans: 保存失败。请检查网络连接后重试

# failed_to_send_msg
source: Не удалось отправить. Проверьте подключение к интернету и попробуйте ещё раз
be: Не атрымалася адправіць. Праверце падключэнне да інтэрнэту і паспрабуйце яшчэ раз
en: Couldn't send. Check your internet connection and try again
zh_hans: 发送失败。请检查网络连接后重试

# failed_to_sign_in_msg
source: Не удалось войти. Проверьте подключение к интернету и попробуйте ещё раз
be: Не ўдалося ўвайсці. Праверце падключэнне да інтэрнэту і паспрабуйце яшчэ раз
en: Couldn't sign in. Check your internet connection and try again
zh_hans: 登录失败。请检查网络连接后重试

# failed_to_upload_file_msg
source: Не удалось загрузить файл. Проверьте подключение к интернету и попробуйте ещё раз
be: Не ўдалося загрузіць файл. Праверце падключэнне да інтэрнэту і паспрабуйце яшчэ раз
en: Couldn't upload the file. Check your internet connection and try again
zh_hans: 文件上传失败。请检查网络连接后重试

# favorites
source: Избранное
be: Абранае
en: Favorites
zh_hans: 收藏

# favorites_and_requests_are_saved_msg
source: Избранное и обращения сохраняются в аккаунте
be: Абранае і звароты захоўваюцца ў акаўнце
en: Favorites and requests are saved to your account
zh_hans: 收藏和申请保存在账户中

# feedback
source: Обратная связь
be: Зваротная сувязь
en: Feedback
zh_hans: 反馈

# for_cemetery_editors_msg
source: Для редакторов мемориала: ветераны, места захоронения, экскурсии и заявки посетителей
be: Для рэдактараў мемарыяла: ветэраны, месцы пахавання, экскурсіі і заяўкі наведвальнікаў
en: For memorial editors: veterans, burial places, tours and visitor submissions
zh_hans: 供纪念馆编辑使用：老兵、安葬地点、导览和访客申请

# from_family_archive
source: Из семейного архива
be: З сямейнага архіва
en: From the family archive
zh_hans: 来自家庭档案

# full_name
source: ФИО
be: ПІБ
en: Full name
zh_hans: 姓名

# galleryHeader
source: Галерея
be: Галерэя
en: Gallery
zh_hans: 图库

# geroj_sssr
source: Герой Советского Союза
be: Герой Савецкага Саюза
en: Hero of the Soviet Union
zh_hans: 苏联英雄

# get_directions
source: Проложить маршрут
be: Пракласці маршрут
en: Get directions
zh_hans: 规划路线

# grave
source: Могила
be: Магіла
en: Grave
zh_hans: 墓

# heroUSSR
source: Герои Советского Союза
be: Героі Савецкага Саюза
en: Heroes of the Soviet Union
zh_hans: 苏联英雄

# heroes_biographies
source: Биографии героев
be: Біяграфіі герояў
en: Heroes’ biographies
zh_hans: 英雄生平

# heroes_biographies_msg
source: Судьбы, награды, фотографии и документы тех, кто покоится на кладбище
be: Лёсы, узнагароды, фотаздымкі і дакументы тых, хто спачывае на могілках
en: Lives, awards, photos and documents of those who rest in the cemetery
zh_hans: 安息于此的人们的生平、荣誉、照片和文件

# historyInfoHeader
source: Историческая справка
be: Гістарычная даведка
en: Historical background
zh_hans: 历史简介

# how_to_add_a_burial_place
source: Как добавить место захоронения?
be: Як дадаць месца пахавання?
en: How to add a burial place?
zh_hans: 如何添加安葬地点？

# how_to_add_a_veteran
source: Как добавить ветерана?
be: Як дадаць ветэрана?
en: How to add a veteran?
zh_hans: 如何添加老兵？

# how_to_add_and_edit_content_msg
source: Как добавлять ветеранов, места и экскурсии
be: Як дадаваць ветэранаў, месцы і экскурсіі
en: How to add veterans, places and tours
zh_hans: 如何添加老兵、地点和导览

# how_to_build_a_tour
source: Как собрать экскурсию?
be: Як сабраць экскурсію?
en: How to build a tour?
zh_hans: 如何创建导览？

# idea
source: Узнавайте биографии, слушайте аудиоэкскурсии, изучайте творчество великих людей!
be: Пазнавайце біяграфіі, слухайце аудиоэкскурсии, вывучайце творчасць вялікіх людзей!
en: Discover biographies, listen to audio tours and explore the work of great people!
zh_hans: 了解生平，收听语音导览，探索伟人的作品！

# if_something_is_wrong
source: Если что-то не так
be: Калі нешта не так
en: If something goes wrong
zh_hans: 遇到问题时

# in_the_morning_of_may_9_msg
source: Утром 9 мая напомним почтить память
be: Раніцай 9 мая нагадаем ушанаваць памяць
en: On the morning of May 9 we'll remind you to honor the memory
zh_hans: 5月9日早上提醒您缅怀英烈
